[NoCoverage] ArrowFunction
angular-testing/src/app/app-routing.module.ts:5:71
 import { Routes, RouterModule } from '@angular/router';
 
 const routes: Routes = [
-  { path: '', loadChildren: () => import('./hello/hello.module').then((module) => module.HelloModule) },
+  { path: '', loadChildren: () => import('./hello/hello.module').then(() => undefined) },
 ];
 

[NoCoverage] ArrowFunction
angular-testing/src/app/app-routing.module.ts:5:29
 import { Routes, RouterModule } from '@angular/router';
 
 const routes: Routes = [
-  { path: '', loadChildren: () => import('./hello/hello.module').then((module) => module.HelloModule) },
+  { path: '', loadChildren: () => undefined },
 ];
 
