[Survived] StringLiteral
app/hello/full-name-list/full-name-list.component.ts:18:20
 export class FullNameListComponent {
   private readonly initName$: BehaviorSubject<string> = new BehaviorSubject<string>('');
 
-  @Input() title = '';
+  @Input() title = "Stryker was here!";
   @Input() set name(value: string) {
     this.initName$.next(value);

[Survived] BlockStatement
app/hello/full-name-list/full-name-list.component.ts:19:36
   private readonly initName$: BehaviorSubject<string> = new BehaviorSubject<string>('');
 
   @Input() title = '';
-  @Input() set name(value: string) {
-    this.initName$.next(value);
-  }
+  @Input() set name(value: string) {}
 
   fullNames$: Observable<FullName[]>;

[Survived] BlockStatement
app/hello/full-name-list/full-name-list.component.ts:25:45
 
   fullNames$: Observable<FullName[]>;
 
-  constructor(private api: HelloApiService) {
-    this.fullNames$ = this.initName$.pipe(
-      switchMap((name) => this.api.getFullNames(name)),
-      share()
-    );
-  }
+  constructor(private api: HelloApiService) {}
 
   trackByFn(index: number): number {

[Survived] ArrowFunction
app/hello/full-name-list/full-name-list.component.ts:27:17
 
   constructor(private api: HelloApiService) {
     this.fullNames$ = this.initName$.pipe(
-      switchMap((name) => this.api.getFullNames(name)),
+      switchMap(() => undefined),
       share()
     );

[NoCoverage] BlockStatement
app/hello/full-name-list/full-name-list.component.ts:32:36
     );
   }
 
-  trackByFn(index: number): number {
-    return index;
-  }
+  trackByFn(index: number): number {}
 }
 
