[NoCoverage] BlockStatement
src/app/hello/hello-api.service.ts:12:54
 export class HelloApiService {
   constructor(private httpClient: HttpClient) {}
 
-  getFullNames(name: string): Observable<FullName[]> {
-    return this.httpClient.get<FullName[]>(`http://localhost:3000/names?=${name}`);
-  }
+  getFullNames(name: string): Observable<FullName[]> {}
 }
 
