[Survived] BlockStatement
angular-testing/src/app/app.component.ts:14:20
 export class AppComponent implements OnInit {
   title = '';
 
-  ngOnInit(): void {
-    this.title = 'Full Names';
-  }
+  ngOnInit(): void {}
 }
 

[Survived] StringLiteral
angular-testing/src/app/app.component.ts:15:18
   title = '';
 
   ngOnInit(): void {
-    this.title = 'Full Names';
+    this.title = "";
   }
 }
