[Survived] ArrayDeclaration
src/app/hello/hello-api.service.stub.ts:4:27
 import { FullName } from './hello.model';
 import { asyncScheduler, Observable, scheduled } from 'rxjs';
 
-export const FAKE_NAMES = [
-  { firstName: 'John', lastName: 'Dow' },
-  { firstName: 'John', lastName: 'Crow' },
-  { firstName: 'John', lastName: 'Bowl' },
-];
+export const FAKE_NAMES = [];
 
 export class HelloApiServiceStub {

[Survived] StringLiteral
src/app/hello/hello-api.service.stub.ts:5:16
 import { asyncScheduler, Observable, scheduled } from 'rxjs';
 
 export const FAKE_NAMES = [
-  { firstName: 'John', lastName: 'Dow' },
+  { firstName: "", lastName: 'Dow' },
   { firstName: 'John', lastName: 'Crow' },
   { firstName: 'John', lastName: 'Bowl' },

[Survived] ObjectLiteral
src/app/hello/hello-api.service.stub.ts:5:3
 import { asyncScheduler, Observable, scheduled } from 'rxjs';
 
 export const FAKE_NAMES = [
-  { firstName: 'John', lastName: 'Dow' },
+  {},
   { firstName: 'John', lastName: 'Crow' },
   { firstName: 'John', lastName: 'Bowl' },

[Survived] StringLiteral
src/app/hello/hello-api.service.stub.ts:6:16
 
 export const FAKE_NAMES = [
   { firstName: 'John', lastName: 'Dow' },
-  { firstName: 'John', lastName: 'Crow' },
+  { firstName: "", lastName: 'Crow' },
   { firstName: 'John', lastName: 'Bowl' },
 ];

[Survived] StringLiteral
src/app/hello/hello-api.service.stub.ts:7:34
 export const FAKE_NAMES = [
   { firstName: 'John', lastName: 'Dow' },
   { firstName: 'John', lastName: 'Crow' },
-  { firstName: 'John', lastName: 'Bowl' },
+  { firstName: 'John', lastName: "" },
 ];
 

[Survived] BlockStatement
src/app/hello/hello-api.service.stub.ts:11:54
 ];
 
 export class HelloApiServiceStub {
-  getFullNames(name: string): Observable<FullName[]> {
-    return scheduled([FAKE_NAMES], asyncScheduler);
-  }
+  getFullNames(name: string): Observable<FullName[]> {}
 }
 
